'''strings

1)написати прогу яка вибирає зі введеної строки цифри і виводить їх через кому,
наприклад:
st = 'as 23 fdfdg544' введена строка
2,3,5,4,4        #вивело в консолі.'''

st = 'as 23 fdfdg544'
print(', '.join(num for num in st if num.isdigit()))

#################################################################################
'''2)написати прогу яка вибирає зі введеної строки числа і виводить їх 
так як вони написані
наприклад:
  st = 'as 23 fdfdg544 34' #введена строка
  23, 544, 34              #вивело в консолі'''
#################################################################################
st = 'as 23 fdfdg544 34'
print(', '.join(''.join(num if num.isdigit() else ' ' for num in st).split()))

'''list comprehension

1)є строка:
greeting = 'Hello, world'
записати кожний символ як окремий елемент списку і зробити його заглавним:
['H', 'E', 'L', 'L', 'O', ',', ' ', 'W', 'O', 'R', 'L', 'D']'''

greeting = 'Hello, world'
res = [i.upper() for i in greeting]
print(res)

'''
2) з диапозону від 0-50 записати тільки не парні числа при цьому піднести їх до квадрату
приклад:
[0, 1, 4, 9, 16, 25, 36, 49, 64, 81, 100, 121, 144, 169, 196, 225, 256, 289, 324, ...]
'''
res = [i ** 2 for i in range(50) if i % 2]
print(res)

'''
function

- створити функцію яка виводить ліст
- створити функцію яка приймає три числа та виводить та повертає найбільше.
- створити функцію яка приймає будь-яку кількість чисел, повертає найменьше, а виводить найбільше
- створити функцію яка повертає найбільше число з ліста
- створити функцію яка повертає найменьше число з ліста
- створити функцію яка приймає ліст чисел та складає значення елементів ліста та повертає його.
- створити функцію яка приймає ліст чисел та повертає середнє арифметичне його значень.

'''
l = [2, 4, 5]


def get_list(l):
    for i in l:
        print(l)


def get_max(num1, num2, num3):
    print(max(num1, num2, num3))
    return max(num1, num2, num3)


def get_num_min_max_display(*num):
    print(max(num))
    return min(max)


def get_max_from_list(l):
    return max(l)


def get_min_from_list(l):
    return min(l)


def get_sum_from_list(l):
    return sum(l)


print(get_sum_from_list(l))


def get_mid_from_list(l):
    return sum(l) / len(l)


################################################################################################
'''1)Дан list:
  list = [22, 3,5,2,8,2,-23, 8,23,5]
  - знайти мін число
  - видалити усі дублікати
  - замінити кожне 4-те значення на 'X'
2) вивести на екран пустий квадрат з "*" сторона якого вказана як агрумент функції
3) вывести табличку множення за допомогою цикла while
4) переробити це завдання під меню'''
list = [22, 3, 5, 2, 8, 2, -23, 8, 23, 5]

print(min(list))  # 1)

print(set(list.copy()))  # 2


# У Python функція set() використовується для створення множини (set), яка є особливим типом колекції, що не містить повторюваних елементів та зберігає елементи в непередбачуваному порядку.
#
# Основні характеристики множини:
# Унікальні елементи: Множина не може містити дублікати. Якщо ви додаєте повторювані значення, вони зберігатимуться лише один раз.
# Непорядкованість: Елементи множини не мають фіксованого порядку.
# Зміна: Множину можна змінювати — додавати або видаляти елементи, проте елементи повинні бути незмінними (не можуть бути списками, словниками тощо).

def chan_x(list):
    cop_ = list.copy()
    print(['X' if (i + 1) % 4 == 0 else item for i, item in enumerate(cop_)])


def squre(num):
    sep = '*'
    i = 0
    while i < num:
        if (i == 0 or i == num - 1):
            print(sep * (num))
        else:
            print(sep + ' ' * (num - 2) + sep)
        i += 1


# табличка
def table_1_to_9():
    start = 1
    end = 9

    while start <= end:

        j = 1
        while j <= end:
            res = j * start

            print('  ' if res < 10 else ' ', end='')
            print(res, end='')
            # або варіант  print(f'{res:4}', end='')

            j += 1
        print()

        start += 1

# menu
while True:
    print('1) Знайти мінімальне число')
    print('2) Видалити усі дублікати')
    print('3) Замінити кожне 4-те значення на "X"')
    print('4) Вивести квадрат')
    print('5) Вивести табличку множення')
    print('9) Вихід')

    value = input('Зробіть свій вибір: ')

    if (value == '1'):
        print(min(list))

    elif (value == '2'):
        print(set(list.copy()))

    elif (value == '3'):
         chan_x(list)

    elif (value == '4'):
         squre(5)

    elif (value == '5'):
         table_1_to_9()

    elif (value == '9'):
        break

